#+property: header-args:bash :results verbatim

** Quick Start

   1) Install development tools: `./setup.sh`
   2) List available tasks: `inv -l`
      #+begin_src bash
        pyenv activate blog
        inv -l
      #+end_src

      #+RESULTS:
      : Available tasks:
      : 
      :   build         Use Jekyll to build the Blog
      :   run           Build+Run the Blog locally
      :   serve         Serves the Blog locally
      :   update-gems   Updates bundler and reinstall all Blog dependencies
      :   view          Open live website in the default browser
      :
   3) [[file:Testing.org]]: general testing advice



** Other Tools used

   1) [Jekyll Docker](https://github.com/envygeeks/jekyll-docker)
   2) Python Virtual Environment with `pyenv`
      ```shell script
      $ pyenv activate
      ```
   3) Manage Ruby Virtual Environments with =rbenv=:
      #+begin_src bash
        rbenv versions
        rbenv --help
      #+end_src

      #+RESULTS:
      #+begin_example
      ,* system
        3.3.0
        3.4.1
      Usage: rbenv <command> [<args>...]

      Commands to manage available Ruby versions:
         versions    List installed Ruby versions
         install     Install a Ruby version using ruby-build
         uninstall   Uninstall a specific Ruby version
         rehash      Regenerate rbenv shims

      Commands to view or change the current Ruby version:
         version     Show the current Ruby version and its origin
         local       Set or show the local application-specific Ruby version
         global      Set or show the global Ruby version
         shell       Set or show the shell-specific Ruby version

      See `rbenv help <command>' for information on a specific command.
      For full documentation, see: https://github.com/rbenv/rbenv#readme
      #+end_example



